{"openai_trace": {"_type": "wb_trace_tree", "root_span_dumps": "{\"span_id\": null, \"name\": \"root_span\", \"start_time_ms\": 1708781145427.554, \"end_time_ms\": 1708781147527.4392, \"status_code\": \"SUCCESS\", \"status_message\": [null], \"attributes\": {\"token_usage\": {\"completion_tokens\": 49, \"prompt_tokens\": 1203, \"total_tokens\": 1252}, \"model_name\": \"gpt-3.5-turbo-0125\"}, \"results\": [{\"inputs\": {\"system_prompt\": {\"role\": \"system\", \"content\": \" Use the provided context to answer the user's query. \\n\\nYou may not answer the user's query unless there is specific context in the following text.\\n\\nIf you do not know the answer, or cannot answer, please respond with \\\"I don't know\\\".\\n\"}, \"user_prompt\": {\"role\": \"user\", \"content\": \" Context:\\nhang Cordelia in the prison, and\\nTo lay the blame upon her own despair,\\nThat she fordid herself.\\nALBANY\\nThe gods defend her! Bear him hence awhile.\\nEDMUND is borne off\\n\\nRe-enter KING LEAR, with CORDELIA dead in his arms; EDGAR, Captain, and others following\\n\\nKING LEAR\\nHowl, howl, howl, howl! O, you are men of stones:\\nHad I your tongues and eyes, I'ld use them so\\nThat heaven's vault should crack. She's gone for ever!\\nI know when one is dead, and when one lives;\\nShe's dead as earth. Lend me a looking-glass;\\nIf that her breath will mist or stain the stone,\\nWhy, then she lives.\\nKENT\\nIs this the promised end\\nEDGAR\\nOr image of that horror?\\nALBANY\\nFall, and cease!\\nKING LEAR\\nThis feather stirs; she lives! if it be so,\\nIt is a chance which does redeem all sorrows\\nThat ever I have felt.\\nKENT\\n[Kneeling] O my good master!\\nKING LEAR\\nPrithee, away.\\nEDGAR\\n'Tis noble Kent, your friend.\\nKING LEAR\\nA plague upon you, murderers, traitors all!\\nI might have saved her; now she's gone for ever!\\nCordelia, Cord\\nom the entire point. Will you have her?\\nShe is herself a dowry.\\nBURGUNDY\\nRoyal Lear,\\nGive but that portion which yourself proposed,\\nAnd here I take Cordelia by the hand,\\nDuchess of Burgundy.\\nKING LEAR\\nNothing: I have sworn; I am firm.\\nBURGUNDY\\nI am sorry, then, you have so lost a father\\nThat you must lose a husband.\\nCORDELIA\\nPeace be with Burgundy!\\nSince that respects of fortune are his love,\\nI shall not be his wife.\\nKING OF FRANCE\\nFairest Cordelia, that art most rich, being poor;\\nMost choice, forsaken; and most loved, despised!\\nThee and thy virtues here I seize upon:\\nBe it lawful I take up what's cast away.\\nGods, gods! 'tis strange that from their cold'st neglect\\nMy love should kindle to inflamed respect.\\nThy dowerless daughter, king, thrown to my chance,\\nIs queen of us, of ours, and our fair France:\\nNot all the dukes of waterish Burgundy\\nCan buy this unprized precious maid of me.\\nBid them farewell, Cordelia, though unkind:\\nThou losest here, a better where to find.\\nKING LEAR\\nThou hast\\nter place.\\nSo, farewell to you both.\\nREGAN\\nPrescribe not us our duties.\\nGONERIL\\nLet your study\\nBe to content your lord, who hath received you\\nAt fortune's alms. You have obedience scanted,\\nAnd well are worth the want that you have wanted.\\nCORDELIA\\nTime shall unfold what plaited cunning hides:\\nWho cover faults, at last shame them derides.\\nWell may you prosper!\\nKING OF FRANCE\\nCome, my fair Cordelia.\\nExeunt KING OF FRANCE and CORDELIA\\n\\nGONERIL\\nSister, it is not a little I have to say of what\\nmost nearly appertains to us both. I think our\\nfather will hence to-night.\\nREGAN\\nThat's most certain, and with you; next month with us.\\nGONERIL\\nYou see how full of changes his age is; the\\nobservation we have made of it hath not been\\nlittle: he always loved our sister most; and\\nwith what poor judgment he hath now cast her off\\nappears too grossly.\\nREGAN\\n'Tis the infirmity of his age: yet he hath ever\\nbut slenderly known himself.\\nGONERIL\\nThe best and soundest of his time hath been but\\nrash; then must we \\n dearest Regan, wife to Cornwall? Speak.\\nREGAN\\nSir, I am made\\nOf the self-same metal that my sister is,\\nAnd prize me at her worth. In my true heart\\nI find she names my very deed of love;\\nOnly she comes too short: that I profess\\nMyself an enemy to all other joys,\\nWhich the most precious square of sense possesses;\\nAnd find I am alone felicitate\\nIn your dear highness' love.\\nCORDELIA\\n[Aside] Then poor Cordelia!\\nAnd yet not so; since, I am sure, my love's\\nMore richer than my tongue.\\nKING LEAR\\nTo thee and thine hereditary ever\\nRemain this ample third of our fair kingdom;\\nNo less in space, validity, and pleasure,\\nThan that conferr'd on Goneril. Now, our joy,\\nAlthough the last, not least; to whose young love\\nThe vines of France and milk of Burgundy\\nStrive to be interess'd; what can you say to draw\\nA third more opulent than your sisters? Speak.\\nCORDELIA\\nNothing, my lord.\\nKING LEAR\\nNothing!\\nCORDELIA\\nNothing.\\nKING LEAR\\nNothing will come of nothing: speak again.\\nCORDELIA\\nUnhappy that I am, I canno\\n\\n\\nUser Query:\\nWhat happens to Cordelia?\\n\"}}, \"outputs\": {\"response\": \"Cordelia tragically dies in King Lear's arms. The scene portrays King Lear's heartbreak and anguish upon realizing her death. It is a poignant moment in the play where King Lear mourns the loss of his beloved daughter Cordelia.\"}}], \"child_spans\": null, \"span_kind\": \"LLM\"}"}, "_timestamp": 1708781147.5274394, "_runtime": 48.784133434295654, "_step": 1, "_wandb": {"runtime": 9}}